use16                       
org 100h  

; Песня  Rick Astley - Never Gonna Give You Up  
; Источник нот: https://github.com/robsoncouto/arduino-songs/blob/master/nevergonnagiveyouup/nevergonnagiveyouup.ino
; Получилось достаточно схоже :D

mov cx,0;

lp:
	mov al, 0xb6
	out 0x43, al

	mov di, Notes_and_dur;
	add di, cx
	mov bx, word[es:di]
	cmp bx,0
	je Delay0;
	mov dx, 0x12
	mov ax, 0x2870
	div bx
	out 0x42, al

	mov al, ah
	out 0x42, al

	push cx

	mov ax, 0x20;
  	mov dx, 0
  	add di, 2;
  	mov bx, word[es:di]
  	cmp bx, 0; 
  	jl less
	;Если часть от длительности неотрицательная
    div bx
    mov ah,0
    mov cx, ax
    jmp make_sound

  less:
  	;Если отрицательная, то делаем положительной
    neg bx
    div bx
    ;Затем умножаем на 3/2
    mov bl,2;
    div bl;
    mov bl,3
    mul bl;
    mov ah,0
    mov cx, ax

  make_sound:
	in al, 0x61
	or al, 00000011b
	out 0x61, al

	call Delay
    pop cx

	in al, 0x61
  	and al, 11111100b
  	out 0x61, al
	jmp cycle;

	Delay0:
	push cx
	mov cx,1
	call Delay;
	pop cx;

	cycle:
	add cx, 4

	cmp cx, lengh1-Notes_and_dur
	jl lp


mov ax,4C00h
int 21h ;Завершение программы

Delay:
	push cx
	push ax
	push dx
	push bx
	push di
	push cx
	mov ah, 0

	int 0x1a;
	pop cx
lp3:
.Wait:
	push cx
	push dx
	mov ah, 0
	int 0x1a
	pop bx
	cmp bx, dx
	pop cx
	je .Wait
	loop lp3;
	pop di
 	pop bx
 	pop dx
 	pop ax
 	pop cx
	ret


Notes_and_dur: dw 587d, -4, 659d,-4, 440d,4,\
    659d,-4, 740d,-4, 880d,16, 784d,16, 740d,8,\
    587d,-4, 659d,-4, 440d,2,\
    440d,16, 440d,16, 494d,16, 587d,8, 587d,16,\
    587d,-4, 659d,-4, 440d,4,\
    659d,-4, 740d,-4, 880d,16, 784d,16, 740d,8,\
    587d,-4, 659d,-4, 440d,2,\
    440d,16, 440d,16, 494d,16, 587d,8, 587d,16,\
    0d,4, 494d,8, 554d,8, 587d,8, 587d,8, 659d,8, 554d,-8,\
    494d,16, 440d,2, 0d,4,\
\
    0d,8, 494d,8, 494d,8, 554d,8, 587d,8, 494d,4, 440d,8,\
    880d,8, 0d,8, 880d,8, 659d,-4, 0d,4,\
    494d,8, 494d,8, 554d,8, 587d,8, 494d,8, 587d,8, 659d,8, 0d,8,\
    0d,8, 554d,8, 494d,8, 440d,-4, 0d,4,\
    0d,8, 494d,8, 494d,8, 554d,8, 587d,8, 494d,8, 440d,4,\
    659d,8, 659d,8, 659d,8, 740d,8, 659d,4, 0d,4,\
\
    587d,2, 659d,8, 740d,8, 587d,8,\
    659d,8, 659d,8, 659d,8, 740d,8, 659d,4, 440d,4,\
    0d,2, 494d,8, 554d,8, 587d,8, 494d,8,\
    0d,8, 659d,8, 740d,8, 659d,-4, 440d,16, 494d,16, 587d,16, 494d,16,\
    740d,-8, 740d,-8, 659d,-4, 440d,6, 494d,16, 587d,16, 494d,16,\
\
    659d,-8, 659d,-8, 587d,-8, 554d,16, 494d,-8, 440d,16, 494d,16, 587d,16, 494d,16,\
    587d,4, 659d,8, 554d,-8, 494d,16, 440d,8, 440d,8, 440d,8,\
    659d,4, 587d,2, 440d,16, 494d,16, 587d,16, 494d,16,\
    740d,-8, 740d,-8, 659d,-4, 440d,16, 494d,16, 587d,16, 494d,16,\
    880d,4, 554d,8, 587d,-8, 554d,16, 494d,8, 440d,16, 494d,16, 587d,16, 494d,16,\
\
    587d,4, 659d,8, 554d,-8, 494d,16, 440d,4, 440d,8,\
    659d,4, 587d,2, 0d,4,\
    0d,8, 494d,8, 587d,8, 494d,8, 587d,8, 659d,4, 0d,8,\
    0d,8, 554d,8, 494d,8, 440d,-4, 0d,4,\
    0d,8, 494d,8, 494d,8, 554d,8, 587d,8, 494d,8, 440d,4,\
    0d,8, 880d,8, 880d,8, 659d,8, 740d,8, 659d,8, 587d,8,\
\
    0d,8, 440d,8, 494d,8, 554d,8, 587d,8, 494d,8,\
    0d,8, 554d,8, 494d,8, 440d,-4, 0d,4,\
    494d,8, 494d,8, 554d,8, 587d,8, 494d,8, 440d,4, 0d,8,\
    0d,8, 659d,8, 659d,8, 740d,4, 659d,-4,\
    587d,2, 587d,8, 659d,8, 740d,8, 659d,4,\
    659d,8, 659d,8, 740d,8, 659d,8, 440d,8, 440d,4,\
\
    0d,-4, 440d,8, 494d,8, 554d,8, 587d,8, 494d,8,\
    0d,8, 659d,8, 740d,8, 659d,-4, 440d,16, 494d,16, 587d,16, 494d,16,\
    740d,-8, 740d,-8, 659d,-4, 440d,16, 494d,16, 587d,16, 494d,16,\
    659d,-8, 659d,-8, 587d,-8, 554d,16, 494d,8, 440d,16, 494d,16, 587d,16, 494d,16,\
    587d,4, 659d,8, 554d,-8, 494d,16, 440d,4, 440d,8,\
\
    659d,4, 587d,2, 440d,16, 494d,16, 587d,16, 494d,16,\
    740d,-8, 740d,-8, 659d,-4, 440d,16, 494d,16, 587d,16, 494d,16,\
    880d,4, 554d,8, 587d,-8, 554d,16, 494d,8, 440d,16, 494d,16, 587d,16, 494d,16,\
    587d,4, 659d,8, 554d,-8, 494d,16, 440d,4, 440d,8,\
    659d,4, 587d,2, 440d,16, 494d,16, 587d,16, 494d,16,\
\
    740d,-8, 740d,-8, 659d,-4, 440d,16, 494d,16, 587d,16, 494d,16,\
    880d,4, 554d,8, 587d,-8, 554d,16, 494d,8, 440d,16, 494d,16, 587d,16, 494d,16,\
    587d,4, 659d,8, 554d,-8, 494d,16, 440d,4, 440d,8,\
    659d,4, 587d,2, 440d,16, 494d,16, 587d,16, 494d,16,\
    740d,-8, 740d,-8, 659d,-4, 440d,16, 494d,16, 587d,16, 494d,16,\
\
    880d,4, 554d,8, 587d,-8, 554d,16, 494d,8, 440d,16, 494d,16, 587d,16, 494d,16,\
    587d,4, 659d,8, 554d,-8, 494d,16, 440d,4, 440d,8,\
\
    659d,4, 587d,2, 0d,4;
lengh1:

size rw 1;
